app/views/lists/show.html.erb

SELECT "spendings".* FROM "spendings" WHERE "spendings"."list_id" = ?  [["list_id", 3]]
---
  <% total = 0 %>
  <% @list.spendings.each do |sp| %>