app/helpers/session_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if @current_user.nil?
      @current_user = User.find_by(id: session[:user_id])