app/controllers/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_id" != ?  [["user_id", 1]]
---
  def index
    @list = List.where(user_id: session[:user_id])
    @users = User.where.not(id: session[:user_id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "spendings".* FROM "spendings" WHERE "spendings"."list_id" = ?  [["list_id", 3]]
---
  def show
    @list = List.find(params[:id])
    @spending = Spending.where(list_id: params[:id])

INSERT INTO "lists" ("title", "category", "amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Another one"], ["category", "Products"], ["amount", 0], ["user_id", 1], ["created_at", "2020-11-14 08:07:35.049350"], ["updated_at", "2020-11-14 08:07:35.049350"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "category" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "FirstTwo"], ["category", "twoSec"], ["updated_at", "2020-11-14 09:22:09.753753"], ["id", 14]]
---
  def update
    @list = List.find(params[:id])
    if @list.update({title: params[:list][:title], category: params[:list][:category]})

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 13]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 1]]
---
  def destroy
    @users = User.where.not(id: session[:user_id])
    @list = List.find_by(:id => params[:format])
    if @list.destroy
      @list = List.where(user_id: session[:user_id])

INSERT INTO "shared_lists" ("user_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["list_id", 14], ["created_at", "2020-11-14 09:21:00.560146"], ["updated_at", "2020-11-14 09:21:00.560146"]]
---
  def share
    @shared_to = SharedList.new(user_id: params[:to_user], list_id: params[:format])
    if @shared_to.save

SELECT "shared_lists".* FROM "shared_lists" WHERE "shared_lists"."user_id" = ?  [["user_id", 2]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def shared_to_me
    array = []
    @shared = SharedList.where(user_id: session[:user_id])
    @shared.each do |item|

SELECT  "spendings".* FROM "spendings" WHERE "spendings"."list_id" = ? LIMIT ?  [["list_id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def shared_values
    @spending = Spending.where(list_id: params[:id])
    @list = List.find(params[:id])
    @from_user = User.find(@list.user_id)