app/controllers/lists_controller.rb

  def index
    @users = User.where.not(id: session[:user_id])
    if params[:category] and params[:amount]
      if !params[:category].empty? && !params[:amount].empty?
        @list = List.where(user_id: session[:user_id],
                           category: params[:category],
                           amount: params[:amount])
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."category" = ? AND "lists"."amount" = ?  [["user_id", 2], ["category", "Traveling"], ["amount", 0]]