app/controllers/session_controller.rb

  def show
    @user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "skipfromua"], ["LIMIT", 1]]