app/controllers/spendings_controller.rb

  def new
    @list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @list = List.find(params[:list_id])
    @spending = Spending.new(spending_params)
    if @spending.save
      this_list_spendings = Spending.where(list_id: params[:list_id])
      @list.update({ amount:this_list_spendings.count })
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "spendings" ("description", "money", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "bas"], ["money", 400.0], ["list_id", 1], ["created_at", "2020-11-13 18:03:44.739225"], ["updated_at", "2020-11-13 18:03:44.739225"]]
SELECT COUNT(*) FROM "spendings" WHERE "spendings"."list_id" = ?  [["list_id", 5]]
UPDATE "lists" SET "amount" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["amount", 1], ["updated_at", "2020-11-14 09:20:02.049728"], ["id", 5]]

  def edit
    @list = List.find(params[:list_id])
    @spending = Spending.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "spendings".* FROM "spendings" WHERE "spendings"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def destroy
    @list = List.find(params[:list_id])
    @spending = Spending.find(params[:id])

    @spending.destroy
    this_list_spendings = Spending.where(list_id: params[:list_id])
    @list.update({ amount:this_list_spendings.count })
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "spendings".* FROM "spendings" WHERE "spendings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "spendings" WHERE "spendings"."id" = ?  [["id", 2]]
UPDATE "spendings" SET "money" = ?, "updated_at" = ? WHERE "spendings"."id" = ?  [["money", 420.0], ["updated_at", "2020-11-13 17:53:37.452756"], ["id", 1]]
SELECT COUNT(*) FROM "spendings"
UPDATE "lists" SET "amount" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["amount", 0], ["updated_at", "2020-11-13 18:08:12.319333"], ["id", 1]]

  def update
    @list = List.find(params[:list_id])
    @spending = Spending.find(params[:id])
    if @spending.update({description: params[:spending][:description], money:params[:spending][:money]})
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "spendings".* FROM "spendings" WHERE "spendings"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "spendings" SET "description" = ?, "updated_at" = ? WHERE "spendings"."id" = ?  [["description", "rwnrw"], ["updated_at", "2020-11-14 09:21:44.544575"], ["id", 11]]